Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/atdf/PIC32CM5164JH00100.atdf
        <register name="CFGA" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Config A register">
          <bitfield name="REFNUM" caption="Number of Reference Clock Cycles" mask="0xFF"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set Register">
          <bitfield name="DONE" caption="Measurement Done Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Register">
          <bitfield name="DONE" caption="Measurement Done" mask="0x1"/>
        </register>
        <register name="STATUS" offset="0xB" rw="RW" size="1" initval="0x00" caption="Status Register">
          <bitfield name="BUSY" caption="FREQM Status" mask="0x1"/>
          <bitfield name="OVF" caption="Sticky Count Value Overflow" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
        <register name="VALUE" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Count Value Register">
          <bitfield name="VALUE" caption="Measurement Value" mask="0xFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="GCLK" id="U2122" version="1.1.2" caption="Generic Clock Generator">
      <register-group name="GCLK" caption="Generic Clock Generator">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy bit" mask="0x1"/>
          <bitfield name="GENCTRL0" caption="Generic Clock Generator Control 0 Synchronization Busy bit" mask="0x4"/>
          <bitfield name="GENCTRL1" caption="Generic Clock Generator Control 1 Synchronization Busy bit" mask="0x8"/>
          <bitfield name="GENCTRL2" caption="Generic Clock Generator Control 2 Synchronization Busy bit" mask="0x10"/>
          <bitfield name="GENCTRL3" caption="Generic Clock Generator Control 3 Synchronization Busy bit" mask="0x20"/>
          <bitfield name="GENCTRL4" caption="Generic Clock Generator Control 4 Synchronization Busy bit" mask="0x40"/>
          <bitfield name="GENCTRL5" caption="Generic Clock Generator Control 5 Synchronization Busy bit" mask="0x80"/>
          <bitfield name="GENCTRL6" caption="Generic Clock Generator Control 6 Synchronization Busy bit" mask="0x100"/>
          <bitfield name="GENCTRL7" caption="Generic Clock Generator Control 7 Synchronization Busy bit" mask="0x200"/>
          <bitfield name="GENCTRL8" caption="Generic Clock Generator Control 8 Synchronization Busy bit" mask="0x400"/>
        </register>
        <register name="GENCTRL" offset="0x20" rw="RW" access="WSYNC" size="4" count="9" initval="0x00000000" caption="Generic Clock Generator Control">
          <bitfield name="SRC" caption="Source Select" mask="0x1F" values="GCLK_GENCTRL__SRC"/>
          <bitfield name="GENEN" caption="Generic Clock Generator Enable" mask="0x100"/>
          <bitfield name="IDC" caption="Improve Duty Cycle" mask="0x200"/>
          <bitfield name="OOV" caption="Output Off Value" mask="0x400"/>
          <bitfield name="OE" caption="Output Enable" mask="0x800"/>
          <bitfield name="DIVSEL" caption="Divide Selection" mask="0x1000" values="GCLK_GENCTRL__DIVSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x2000"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="PCHCTRL" offset="0x80" rw="RW" size="4" count="43" initval="0x00000000" caption="Peripheral Clock Control">
          <bitfield name="GEN" caption="Generic Clock Generator" mask="0xF" values="GCLK_PCHCTRL__GEN"/>
          <bitfield name="CHEN" caption="Channel Enable" mask="0x40"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x80"/>
        </register>
      </register-group>
      <value-group name="GCLK_GENCTRL__DIVSEL">
        <value name="DIV1" caption="Division by GENCTRLn.DIV" value="0x0"/>
        <value name="DIV2" caption="Division by 2^(GENCTRLn.DIV+1)" value="0x1"/>
      </value-group>
      <value-group name="GCLK_GENCTRL__SRC">
        <value name="XOSC" caption="XOSC oscillator output" value="0"/>
        <value name="GCLKIN" caption="Generator input pad (GCLK_IO)" value="1"/>
        <value name="GCLKGEN1" caption="Generic clock generator 1 output" value="2"/>
        <value name="OSCULP32K" caption="OSCULP32K oscillator output" value="3"/>
        <value name="OSC32K" caption="OSC32K oscillator output" value="4"/>
        <value name="XOSC32K" caption="XOSC32K oscillator output" value="5"/>
        <value name="OSC48M" caption="OSC48M oscillator output" value="6"/>
        <value name="FDPLL96M" caption="FDPLL96M output" value="7"/>
      </value-group>
      <value-group name="GCLK_PCHCTRL__GEN">
        <value name="GCLK0" caption="Generic clock generator 0" value="0x0"/>
        <value name="GCLK1" caption="Generic clock generator 1" value="0x1"/>
        <value name="GCLK2" caption="Generic clock generator 2" value="0x2"/>
        <value name="GCLK3" caption="Generic clock generator 3" value="0x3"/>
        <value name="GCLK4" caption="Generic clock generator 4" value="0x4"/>
        <value name="GCLK5" caption="Generic clock generator 5" value="0x5"/>
        <value name="GCLK6" caption="Generic clock generator 6" value="0x6"/>
        <value name="GCLK7" caption="Generic clock generator 7" value="0x7"/>
        <value name="GCLK8" caption="Generic clock generator 8" value="0x8"/>
      </value-group>
    </module>
    <module name="ICM" id="U2010" version="1.2.0" caption="Integrity Check Monitor">
      <register-group name="ICM" caption="Integrity Check Monitor">
        <register name="CFG" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Configuration">
          <bitfield name="WBDIS" caption="Write Back Disable" mask="0x1"/>
          <bitfield name="EOMDIS" caption="End of Monitoring Disable" mask="0x2"/>
          <bitfield name="SLBDIS" caption="Secondary List Branching Disable" mask="0x4"/>
          <bitfield name="BBC" caption="Bus Burden Control" mask="0xF0"/>
          <bitfield name="ASCD" caption="Automatic Switch To Compare Digest" mask="0x100"/>
          <bitfield name="DUALBUFF" caption="Dual Input Buffer" mask="0x200"/>
          <bitfield name="UIHASH" caption="User Initial Hash Value" mask="0x1000"/>
          <bitfield name="UALGO" caption="User SHA Algorithm" mask="0xE000" values="ICM_CFG__UALGO"/>
        </register>
        <register name="CTRL" offset="0x4" rw="W" size="4" access-size="4" caption="Control">
          <bitfield name="ENABLE" caption="ICM Enable" mask="0x1"/>
          <bitfield name="DISABLE" caption="ICM Disable Register" mask="0x2"/>
          <bitfield name="SWRST" caption="Software Reset" mask="0x4"/>
          <bitfield name="REHASH" caption="Recompute Internal Hash" mask="0xF0"/>
          <bitfield name="RMDIS" caption="Region Monitoring Disable" mask="0xF00"/>
          <bitfield name="RMEN" caption="Region Monitoring Enable" mask="0xF000"/>
        </register>
        <register name="SR" offset="0x8" rw="R" size="4" access-size="4" initval="0x00000000" caption="Status">
          <bitfield name="ENABLE" caption="ICM Controller Enable Register" mask="0x1"/>
          <bitfield name="RAWRMDIS" caption="RAW Region Monitoring Disabled Status" mask="0xF00"/>
          <bitfield name="RMDIS" caption="Region Monitoring Disabled Status" mask="0xF000"/>
        </register>
        <register name="IER" offset="0x10" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable">
          <bitfield name="RHC" caption="Region Hash Completed Interrupt Enable" mask="0xF"/>
          <bitfield name="RDM" caption="Region Digest Mismatch Interrupt Enable" mask="0xF0"/>
          <bitfield name="RBE" caption="Region Bus Error Interrupt Enable" mask="0xF00"/>
          <bitfield name="RWC" caption="Region Wrap Condition detected Interrupt Enable" mask="0xF000"/>
          <bitfield name="REC" caption="Region End bit Condition Detected Interrupt Enable" mask="0xF0000"/>
          <bitfield name="RSU" caption="Region Status Updated Interrupt Disable" mask="0xF00000"/>
          <bitfield name="URAD" caption="Undefined Register Access Detection Interrupt Enable" mask="0x1000000"/>
        </register>
