Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/atdf/PIC32CM5164JH00100.atdf
        <register name="APBDMASK" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="APBD Mask">
          <bitfield name="SERCOM6_" caption="SERCOM6 APB Clock Enable" mask="0x1"/>
          <bitfield name="SERCOM7_" caption="SERCOM7 APB Clock Enable" mask="0x2"/>
          <bitfield name="TC5_" caption="TC5 APB Clock Enable" mask="0x4"/>
          <bitfield name="TC6_" caption="TC6 APB Clock Enable" mask="0x8"/>
          <bitfield name="TC7_" caption="TC7 APB Clock Enable" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="MCLK_CPUDIV__CPUDIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MCRAMC" id="03727" name2="drm_mcramc_v3" version="3a0" caption="Multi-Channel RAM Controller">
      <register-group name="MCRAMC" caption="Multi-Channel RAM Controller">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000002" caption="Control Enable A Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CTRLA__SWRST"/>
          <bitfield name="ENABLE" caption="ECC Decoder Enable" mask="0x2" values="CTRLA__ENABLE"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="4" access-size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Clear" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Clear" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0xC" rw="RW" size="4" access-size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set Register">
          <bitfield name="SERREN" caption="Single Bit Error Interrupt Enable, Set" mask="0x1"/>
          <bitfield name="DERREN" caption="Double Bit Error Interrupt Enable, Set" mask="0x2"/>
        </register>
        <register name="INTSTA" offset="0x10" rw="RW" size="4" access-size="4" atomic-op="clear:INTSTA" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="SERR" caption="Single Bit Error" mask="0x1"/>
          <bitfield name="DERR" caption="Double Bit Error" mask="0x2"/>
        </register>
        <register name="FLTCTRL" offset="0x14" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Control Register">
          <bitfield name="FLTEN" caption="Fault Injection Enabled" mask="0x2" values="FLTCTRL__FLTEN"/>
          <bitfield name="FLTMD" caption="Fault Injection Mode" mask="0x3000" values="FLTCTRL__FLTMD"/>
        </register>
        <register name="FLTPTR" offset="0x18" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Pointer Register">
          <bitfield name="FLT1PTR" caption="Single Fault Injection Bit Pointer" mask="0xFF"/>
          <bitfield name="FLT2PTR" caption="Double Fault Injection Bit Pointer" mask="0xFF0000"/>
        </register>
        <register name="FLTADR" offset="0x1C" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Fault Injection Address Register">
          <bitfield name="FLTADR" caption="Fault Address Offset" mask="0xFFFFFF"/>
        </register>
        <register name="ERRCADR" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Address Register">
          <bitfield name="ERCADR" caption="ECC SECDED Error Capture Address" mask="0xFFFFFF"/>
        </register>
        <register name="ERRCPAR" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Parity Register">
          <bitfield name="ERCPAR" caption="ECC SECDED Error Capture Parity" mask="0x7F"/>
        </register>
        <register name="ERRCSYN" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="Error Capture Syndrome Register">
          <bitfield name="ERCSYN" caption="ECC SECDED Error Capture Syndrome" mask="0x7F" values="ERRCSYN__ERCSYN"/>
          <bitfield name="ERR1" caption="ECC Single Bit Error" mask="0x4000"/>
          <bitfield name="ERR2" caption="ECC Double Bit Error" mask="0x8000" values="ERRCSYN__ERR2"/>
        </register>
      </register-group>
      <value-group name="CTRLA__ENABLE">
        <value name="0" caption="ECC decoding is disabled." value="0"/>
        <value name="1" caption="ECC decoding is enabled." value="1"/>
      </value-group>
      <value-group name="CTRLA__SWRST">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Reset the MCRAMC. A software-triggered hardware reset of the MCRAMC user interface is performed." value="1"/>
      </value-group>
      <value-group name="FLTCTRL__FLTEN">
        <value name="0" caption="Disables fault injection." value="0"/>
        <value name="1" caption="Enables fault injection at FLTADR address offset as selected by FLTMD and FLTxPTR." value="1"/>
      </value-group>
      <value-group name="FLTCTRL__FLTMD">
        <value name="DISABLE" caption="Fault Injection Disabled" value="0x0"/>
        <value name="SINGLE" caption="Single Fault Injection at bit selected by FLTPTR.FTL1PTR" value="0x1"/>
        <value name="DOUBLE" caption="Double Fault Injection at bits FLTPTR.FTL1PTR and FLTPTR.FTL2PTR" value="0x2"/>
      </value-group>
      <value-group name="ERRCSYN__ERCSYN">
        <value name="0" caption="Not a Single bit error." value="0"/>
        <value name="1" caption="Single bit error." value="1"/>
      </value-group>
      <value-group name="ERRCSYN__ERR2">
        <value name="0" caption="Not a Double bit error." value="0"/>
        <value name="1" caption="Double bit error." value="1"/>
      </value-group>
    </module>
    <module name="MPU" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="TYPE" offset="0x0" rw="R" size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instruction and Data Memory MapsRegions" mask="0x1"/>
          <bitfield name="DREGION" caption="Number of Data Regions" mask="0xFF00"/>
          <bitfield name="IREGION" caption="Number of Instruction Regions" mask="0xFF0000"/>
        </register>
