Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/atdf/PIC32CM5164JH00100.atdf
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="XOSCFAIL" caption="XOSC Clock Failure Detector" mask="0x2"/>
          <bitfield name="XOSCCKSW" caption="XOSC Clock Switch" mask="0x4"/>
          <bitfield name="OSC48MRDY" caption="OSC48M Ready" mask="0x10"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x100"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x200"/>
          <bitfield name="DPLLLTO" caption="DPLL Timeout" mask="0x400"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready" mask="0x800"/>
        </register>
        <register name="XOSCCTRL" offset="0x10" rw="RW" size="2" initval="0x0080" caption="External Multipurpose Crystal Oscillator (XOSC) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="CFDEN" caption="Xosc Clock Failure Detector Enable" mask="0x8"/>
          <bitfield name="SWBEN" caption="Clock Switch Back Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="GAIN" caption="Oscillator Gain" mask="0x700" values="OSCCTRL_XOSCCTRL__GAIN"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000" values="OSCCTRL_XOSCCTRL__STARTUP"/>
        </register>
        <register name="CFDPRESC" offset="0x12" rw="RW" size="1" initval="0x00" caption="Clock Failure Detector Prescaler">
          <bitfield name="CFDPRESC" caption="Clock Failure Detector Prescaler" mask="0x7" values="OSCCTRL_CFDPRESC__CFDPRESC"/>
        </register>
        <register name="EVCTRL" offset="0x13" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="CFDEO" caption="Clock Failure Detector Event Output Enable" mask="0x1"/>
        </register>
        <register name="OSC48MCTRL" offset="0x14" rw="RW" size="1" initval="0x82" caption="48MHz Internal Oscillator (OSC48M) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="OSC48MDIV" offset="0x15" rw="RW" access="WSYNC" size="1" initval="0x0B" caption="OSC48M Divider">
          <bitfield name="DIV" caption="OSC48M Division Factor" mask="0xF" values="OSCCTRL_OSC48MDIV__DIV"/>
        </register>
        <register name="OSC48MSTUP" offset="0x16" rw="RW" size="1" initval="0x07" caption="OSC48M Startup Time">
          <bitfield name="STARTUP" caption="Startup Time" mask="0x7" values="OSCCTRL_OSC48MSTUP__STARTUP"/>
        </register>
        <register name="OSC48MSYNCBUSY" offset="0x18" rw="R" size="4" initval="0x00000000" caption="OSC48M Synchronization Busy">
          <bitfield name="OSC48MDIV" caption="OSC48MDIV Synchronization Status" mask="0x4"/>
        </register>
        <register name="DPLLCTRLA" offset="0x1C" rw="RW" access="WSYNC" size="1" initval="0x80" caption="DPLL Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand" mask="0x80"/>
        </register>
        <register name="DPLLRATIO" offset="0x20" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="DPLL Ratio Control">
          <bitfield name="LDR" caption="Loop Divider Ratio" mask="0xFFF"/>
          <bitfield name="LDRFRAC" caption="Loop Divider Ratio Fractional Part" mask="0xF0000"/>
        </register>
        <register name="DPLLCTRLB" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Digital Core Configuration">
          <bitfield name="FILTER" caption="Proportional Integral Filter Selection" mask="0x3" values="OSCCTRL_DPLLCTRLB__FILTER"/>
          <bitfield name="LPEN" caption="Low-Power Enable" mask="0x4"/>
          <bitfield name="WUF" caption="Wake Up Fast" mask="0x8"/>
          <bitfield name="REFCLK" caption="Reference Clock Selection" mask="0x30" values="OSCCTRL_DPLLCTRLB__REFCLK"/>
          <bitfield name="LTIME" caption="Lock Time" mask="0x700" values="OSCCTRL_DPLLCTRLB__LTIME"/>
          <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x1000"/>
          <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
        </register>
        <register name="DPLLPRESC" offset="0x28" rw="RW" access="WSYNC" size="1" initval="0x00" caption="DPLL Prescaler">
          <bitfield name="PRESC" caption="Output Clock Prescaler" mask="0x3" values="OSCCTRL_DPLLPRESC__PRESC"/>
        </register>
        <register name="DPLLSYNCBUSY" offset="0x2C" rw="R" size="1" initval="0x00" caption="DPLL Synchronization Busy">
          <bitfield name="ENABLE" caption="DPLL Enable Synchronization Status" mask="0x2"/>
          <bitfield name="DPLLRATIO" caption="DPLL Ratio Synchronization Status" mask="0x4"/>
          <bitfield name="DPLLPRESC" caption="DPLL Prescaler Synchronization Status" mask="0x8"/>
        </register>
        <register name="DPLLSTATUS" offset="0x30" rw="R" size="1" initval="0x00" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock Status" mask="0x1"/>
          <bitfield name="CLKRDY" caption="DPLL Clock Ready" mask="0x2"/>
        </register>
        <register name="CAL48M" offset="0x38" rw="RW" size="4" initval="0x00200220" caption="48MHz Oscillator Calibration">
          <bitfield name="FCAL" caption="Frequency Calibration (48MHz)" mask="0x3F"/>
          <bitfield name="FRANGE" caption="Frequency Range (48MHz)" mask="0x300"/>
          <bitfield name="TCAL" caption="Temperature Calibration (48MHz)" mask="0x3F0000"/>
        </register>
      </register-group>
      <value-group name="OSCCTRL_XOSCCTRL__STARTUP">
        <value name="CYCLE1" caption="1 cycle" value="0x0"/>
        <value name="CYCLE2" caption="2 cycles" value="0x1"/>
        <value name="CYCLE4" caption="4 cycles" value="0x2"/>
        <value name="CYCLE8" caption="8 cycles" value="0x3"/>
        <value name="CYCLE16" caption="16 cycles" value="0x4"/>
        <value name="CYCLE32" caption="32 cycles" value="0x5"/>
        <value name="CYCLE64" caption="64 cycles" value="0x6"/>
        <value name="CYCLE128" caption="128 cycles" value="0x7"/>
        <value name="CYCLE256" caption="256 cycles" value="0x8"/>
        <value name="CYCLE512" caption="512 cycles" value="0x9"/>
        <value name="CYCLE1024" caption="1024 cycles" value="0xA"/>
        <value name="CYCLE2048" caption="2048 cycles" value="0xB"/>
        <value name="CYCLE4096" caption="4096 cycles" value="0xC"/>
        <value name="CYCLE8192" caption="8192 cycles" value="0xD"/>
        <value name="CYCLE16384" caption="16384 cycles" value="0xE"/>
        <value name="CYCLE32768" caption="32768 cycles" value="0xF"/>
      </value-group>
      <value-group name="OSCCTRL_XOSCCTRL__GAIN">
        <value name="GAIN2" caption="2 MHz" value="0"/>
        <value name="GAIN4" caption="4 MHz" value="1"/>
        <value name="GAIN8" caption="8 MHz" value="2"/>
        <value name="GAIN16" caption="16 MHz" value="3"/>
        <value name="GAIN32" caption="32 MHz" value="4"/>
      </value-group>
      <value-group name="OSCCTRL_CFDPRESC__CFDPRESC">
        <value name="DIV1" caption=" OSC48M frequency" value="0"/>
        <value name="DIV2" caption=" OSC48M frequency / 2" value="1"/>
        <value name="DIV4" caption=" OSC48M frequency / 4" value="2"/>
        <value name="DIV8" caption=" OSC48M frequency / 8" value="3"/>
        <value name="DIV16" caption="OSC48M frequency / 16" value="4"/>
        <value name="DIV32" caption="OSC48M frequency / 32" value="5"/>
        <value name="DIV64" caption="OSC48M frequency / 64" value="6"/>
        <value name="DIV128" caption="OSC48M frequency / 128" value="7"/>
      </value-group>
