Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/atdf/PIC32CM5164JH00100.atdf
        <register name="SHPR2" offset="0xD1C" rw="RW" size="4" initval="0x00000000" caption="System Handler Priority Register 2">
          <bitfield name="PRI_11" caption="Priority of system handler 11, SVCall" mask="0xFF000000"/>
        </register>
        <register name="SHPR3" offset="0xD20" rw="RW" size="4" initval="0x00000000" caption="System Handler Priority Register 3">
          <bitfield name="PRI_14" caption="Priority of system handler 14, PendSV" mask="0xFF0000"/>
          <bitfield name="PRI_15" caption="Priority of system handler 15, SysTick exception" mask="0xFF000000"/>
        </register>
        <register name="SHCSR" offset="0xD24" rw="RW" size="4" initval="0x00000000" caption="System Handler Control and State Register">
          <bitfield name="SVCALLPENDED" caption="no description available" mask="0x8000"/>
        </register>
        <register name="DFSR" offset="0xD30" rw="RW" size="4" initval="0x00000000" caption="Debug Fault Status Register">
          <bitfield name="HALTED" caption="Halt request debug event active" mask="0x1"/>
          <bitfield name="BKPT" caption="Breakpoint debug event" mask="0x2"/>
          <bitfield name="DWTTRAP" caption="DWT debug event" mask="0x4"/>
          <bitfield name="VCATCH" caption="Vector catch debug event" mask="0x8"/>
          <bitfield name="EXTERNAL" caption="EDBGRQ debug event" mask="0x10"/>
        </register>
      </register-group>
      <value-group name="SystemControl_ICSR__NMIPENDSET">
        <value name="VALUE_0" caption="Write: no effect; read: NMI exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes NMI exception state to pending; read: NMI exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the SysTick exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSTSET">
        <value name="VALUE_0" caption="Write: no effect; read: SysTick exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes SysTick exception state to pending; read: SysTick exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVCLR">
        <value name="VALUE_0" caption="No effect" value="0"/>
        <value name="VALUE_1" caption="Removes the pending state from the PendSV exception" value="1"/>
      </value-group>
      <value-group name="SystemControl_ICSR__PENDSVSET">
        <value name="VALUE_0" caption="Write: no effect; read: PendSV exception is not pending" value="0"/>
        <value name="VALUE_1" caption="Write: changes PendSV exception state to pending; read: PendSV exception is pending" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__ENDIANNESS">
        <value name="VALUE_0" caption="Little-endian" value="0"/>
        <value name="VALUE_1" caption="Big-endian" value="1"/>
      </value-group>
      <value-group name="SystemControl_AIRCR__SYSRESETREQ">
        <value name="VALUE_0" caption="No system reset request" value="0"/>
        <value name="VALUE_1" caption="Asserts a signal to the outer system that requests a reset" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SEVONPEND">
        <value name="VALUE_0" caption="Only enabled interrupts or events can wakeup the processor, disabled interrupts are excluded" value="0"/>
        <value name="VALUE_1" caption="Enabled events and all interrupts, including disabled interrupts, can wakeup the processor" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
    <module name="TC" id="U2249" version="3.0.0" caption="Basic Timer Counter">
      <register-group name="TC" caption="Basic Timer Counter">
        <mode name="COUNT8" qualifier="TC.CTRLA.MODE" value="1" caption="8-bit Counter Mode"/>
        <mode name="COUNT16" qualifier="TC.CTRLA.MODE" value="0" caption="16-bit Counter Mode"/>
        <mode name="COUNT32" qualifier="TC.CTRLA.MODE" value="2" caption="32-bit Counter Mode"/>
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Timer Counter Mode" mask="0xC" values="TC_CTRLA__MODE"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x30" values="TC_CTRLA__PRESCSYNC"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="Clock On Demand" mask="0x80"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TC_CTRLA__PRESCALER"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
          <bitfield name="CAPTEN0" caption="Capture Channel 0 Enable" mask="0x10000"/>
          <bitfield name="CAPTEN1" caption="Capture Channel 1 Enable" mask="0x20000"/>
          <bitfield name="COPEN0" caption="Capture On Pin 0 Enable" mask="0x100000"/>
          <bitfield name="COPEN1" caption="Capture On Pin 1 Enable" mask="0x200000"/>
          <bitfield name="CAPTMODE0" caption="Capture Mode Channel 0" mask="0x3000000" values="TC_CTRLA__CAPTMODE0"/>
          <bitfield name="CAPTMODE1" caption="Capture mode Channel 1" mask="0x18000000" values="TC_CTRLA__CAPTMODE1"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot on Counter" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="TC_CTRLBSET__CMD"/>
        </register>
